In [1]:
%load_ext sql

In [2]:
from sqlalchemy import create_engine

In [3]:
%sql postgresql://postgres:root@localhost/Practice

# Question

## Write a query to return the lowest token number which is unique to a customer (meaning token should be allocated to just a single customer)

In [4]:
%%sql

CREATE TABLE Tokens 
(
    Token_Num	INT,
    Customer	VARCHAR(512)
);

INSERT INTO Tokens (Token_Num, Customer) VALUES
	('1', 'Maryam'),
	('2', 'Rocky'),
	('3', 'John'),
	('3', 'John'),
	('2', 'Arya'),
	('1', 'Pascal'),
	('9', 'Kate'),
	('9', 'Ibrahim'),
	('8', 'Lilly'),
	('8', 'Lilly'),
	('5', 'Shane');

 * postgresql://postgres:***@localhost/Practice
Done.
11 rows affected.

[]

In [5]:
%%sql

select * from tokens

 * postgresql://postgres:***@localhost/Practice
11 rows affected.

[(1, 'Maryam'),
 (2, 'Rocky'),
 (3, 'John'),
 (3, 'John'),
 (2, 'Arya'),
 (1, 'Pascal'),
 (9, 'Kate'),
 (9, 'Ibrahim'),
 (8, 'Lilly'),
 (8, 'Lilly'),
 (5, 'Shane')]

## Solution

In [13]:
%%sql

select token_num
from (select distinct * from tokens) t
group by token_num
having count(token_num) = 1
order by token_num
limit 1

 * postgresql://postgres:***@localhost/Practice
1 rows affected.

[(3,)]